feat: added mermaid diagrams, removed obsidian notation
